"""
Необхідно написати програму на Python, яка використовує два підходи — жадібний алгоритм та алгоритм динамічного
програмування для розв’язання задачі вибору їжі з найбільшою сумарною калорійністю в межах обмеженого бюджету.

Кожен вид їжі має вказану вартість і калорійність. Дані про їжу представлені у вигляді словника, де ключ — назва страви,
а значення — це словник з вартістю та калорійністю.
Розробіть функцію greedy_algorithm жадібного алгоритму, яка вибирає страви, максимізуючи співвідношення калорій до
вартості, не перевищуючи заданий бюджет.

Для реалізації алгоритму динамічного програмування створіть функцію dynamic_programming, яка обчислює оптимальний набір
страв для максимізації калорійності при заданому бюджеті.
"""

